tutorials/surfaceTracking/bubbleInterTrackFoam/bubble2D_r0.75mm/constant/freeSurfaceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      freeSurfaceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

twoFluids yes;

normalMotionDir yes;

motionDir (0 0 0);

cleanInterface yes;

muFluidA muFluidA [ 1 -1 -1 0 0 0 0 ] 83.300e-5;

muFluidB muFluidB [ 1 -1 -1 0 0 0 0 ] 1.856e-5;

rhoFluidA rhoFluidA [ 1 -3  0 0 0 0 0 ] 996.31;

rhoFluidB rhoFluidB [ 1 -3  0 0 0 0 0 ] 1.173;

surfaceTension surfaceTension [ 1 0 -2 0 0 0 0 ] 0.07232;

g g [ 0 1 -2 0 0 0 0 ] ( 0 -9.81 0);

fixedFreeSurfacePatches 0 ();

pointNormalsCorrectionPatches 0 ();

nFreeSurfaceCorrectors 1;


surfactantProperties
{
bulkConc            bulkConc            [ 0 -3  0 0  1 0 0 ] 1.0e-2;

saturatedConc       saturatedSurfConc   [ 0 -2  0 0  1 0 0 ] 5.0e-6;

adsorptionCoeff     adsorptionCoeff     [ 0  3 -1 0 -1 0 0 ] 40.0;

desorptionCoeff     desorptionCoeff     [ 0 -3  0 0  1 0 0 ] 8.93e-2;

bulkDiffusion       bulkDiffusion       [ 0  2 -1 0  0 0 0 ] 1.0e-9;

//diffusion           diffusion           [ 0  2 -1 0  0 0 0 ] 1.0e-9;
diffusion           diffusion           [ 0  2 -1 0  0 0 0 ] 1.0e-7;

temperature         temperature         [ 0  0  0 1  0 0 0 ] 293.0;
}

// ************************************************************************* //
